testing/archive/load_test_4_24_2025__4_24_23_pm.log
2025-04-24 16:24:23,983 - Test start time: 4_24_2025__4_24_23_pm
2025-04-24 16:24:24,279 - Test Started: 18:24 rate: 60 pods: 3
2025-04-24 16:25:24,614 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 1547.870ms, rate sampling interval: 5488ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.29s     4.80s   21.66s    58.04%
    Req/Sec    40.44      3.40    45.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.49s 
 75.000%   14.31s 
 90.000%   16.53s 
 99.000%   19.35s 
 99.900%   21.41s 
 99.990%   21.68s 
 99.999%   21.68s 
100.000%   21.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1160.191     0.000000            1         1.00
    3457.023     0.100000          206         1.11
    5275.647     0.200000          413         1.25
    7041.023     0.300000          616         1.43
    8896.511     0.400000          823         1.67
   10485.759     0.500000         1027         2.00
   11231.231     0.550000         1129         2.22
   11878.399     0.600000         1232         2.50
   12648.447     0.650000         1334         2.86
   13647.871     0.700000         1437         3.33
   14311.423     0.750000         1539         4.00
   14770.175     0.775000         1591         4.44
   15130.623     0.800000         1642         5.00
   15400.959     0.825000         1693         5.71
   15712.255     0.850000         1747         6.67
   16195.583     0.875000         1796         8.00
   16392.191     0.887500         1822         8.89
   16531.455     0.900000         1847        10.00
   16728.063     0.912500         1874        11.43
   16924.671     0.925000         1899        13.33
   17186.815     0.937500         1924        16.00
   17334.271     0.943750         1937        17.78
   17612.799     0.950000         1951        20.00
   17858.559     0.956250         1963        22.86
   18137.087     0.962500         1976        26.67
   18284.543     0.968750         1988        32.00
   18382.847     0.971875         1995        35.56
   18530.303     0.975000         2001        40.00
   18759.679     0.978125         2009        45.71
   18907.135     0.981250         2015        53.33
   19038.207     0.984375         2020        64.00
   19103.743     0.985938         2024        71.11
   19169.279     0.987500         2027        80.00
   19267.583     0.989062         2030        91.43
   19578.879     0.990625         2033       106.67
   20299.775     0.992188         2036       128.00
   20381.695     0.992969         2038       142.22
   20578.303     0.993750         2040       160.00
   20873.215     0.994531         2041       182.86
   21086.207     0.995313         2043       213.33
   21102.591     0.996094         2044       256.00
   21168.127     0.996484         2045       284.44
   21184.511     0.996875         2046       320.00
   21299.199     0.997266         2048       365.71
   21299.199     0.997656         2048       426.67
   21299.199     0.998047         2048       512.00
   21381.119     0.998242         2049       568.89
   21381.119     0.998437         2049       640.00
   21413.887     0.998633         2050       731.43
   21413.887     0.998828         2050       853.33
   21413.887     0.999023         2050      1024.00
   21544.959     0.999121         2051      1137.78
   21544.959     0.999219         2051      1280.00
   21544.959     0.999316         2051      1462.86
   21544.959     0.999414         2051      1706.67
   21544.959     0.999512         2051      2048.00
   21676.031     0.999561         2052      2275.56
   21676.031     1.000000         2052          inf
#[Mean    =    10289.739, StdDeviation   =     4804.962]
#[Max     =    21659.648, Total count    =         2052]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2487 requests in 1.00m, 30.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:     41.42
Transfer/sec:    517.03KB

2025-04-24 16:25:24,911 - Test completed: wrk2 -t1 -c8 -d60s -R60 --latency http://128.105.146.155/
2025-04-24 16:25:25,195 - Test Started: 18:25 rate: 120 pods: 3
2025-04-24 16:26:25,567 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 3119.755ms, rate sampling interval: 11657ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.57s     9.51s   41.42s    58.39%
    Req/Sec    42.00      2.00    44.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.92s 
 75.000%   30.97s 
 90.000%   36.11s 
 99.000%   39.91s 
 99.900%   41.16s 
 99.990%   41.45s 
 99.999%   41.45s 
100.000%   41.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6451.199     0.000000            1         1.00
    9666.559     0.100000          214         1.11
   12984.319     0.200000          425         1.25
   16146.431     0.300000          637         1.43
   19005.439     0.400000          851         1.67
   21921.791     0.500000         1061         2.00
   23658.495     0.550000         1169         2.22
   25640.959     0.600000         1275         2.50
   27049.983     0.650000         1381         2.86
   28622.847     0.700000         1486         3.33
   30965.759     0.750000         1593         4.00
   31768.575     0.775000         1647         4.44
   32538.623     0.800000         1698         5.00
   33341.439     0.825000         1752         5.71
   34078.719     0.850000         1804         6.67
   35028.991     0.875000         1858         8.00
   35520.511     0.887500         1885         8.89
   36110.335     0.900000         1911        10.00
   36503.551     0.912500         1939        11.43
   36896.767     0.925000         1963        13.33
   37224.447     0.937500         1990        16.00
   37552.127     0.943750         2004        17.78
   37781.503     0.950000         2017        20.00
   38174.719     0.956250         2032        22.86
   38469.631     0.962500         2046        26.67
   38666.239     0.968750         2057        32.00
   38764.543     0.971875         2064        35.56
   38993.919     0.975000         2070        40.00
   39092.223     0.978125         2076        45.71
   39190.527     0.981250         2083        53.33
   39452.671     0.984375         2090        64.00
   39550.975     0.985938         2093        71.11
   39747.583     0.987500         2096        80.00
   39845.887     0.989062         2100        91.43
   40009.727     0.990625         2103       106.67
   40271.871     0.992188         2106       128.00
   40370.175     0.992969         2108       142.22
   40435.711     0.993750         2111       160.00
   40435.711     0.994531         2111       182.86
   40632.319     0.995313         2114       213.33
   40632.319     0.996094         2114       256.00
   40796.159     0.996484         2115       284.44
   40828.927     0.996875         2116       320.00
   40861.695     0.997266         2118       365.71
   40861.695     0.997656         2118       426.67
   40861.695     0.998047         2118       512.00
   41123.839     0.998242         2119       568.89
   41123.839     0.998437         2119       640.00
   41156.607     0.998633         2120       731.43
   41156.607     0.998828         2120       853.33
   41156.607     0.999023         2120      1024.00
   41320.447     0.999121         2121      1137.78
   41320.447     0.999219         2121      1280.00
   41320.447     0.999316         2121      1462.86
   41320.447     0.999414         2121      1706.67
   41320.447     0.999512         2121      2048.00
   41451.519     0.999561         2122      2275.56
   41451.519     1.000000         2122          inf
#[Mean    =    22566.013, StdDeviation   =     9513.781]
#[Max     =    41418.752, Total count    =         2122]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2516 requests in 1.00m, 31.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:     41.90
Transfer/sec:    530.45KB

2025-04-24 16:26:25,870 - Test completed: wrk2 -t1 -c8 -d60s -R120 --latency http://128.105.146.155/
2025-04-24 16:26:26,152 - Test Started: 18:26 rate: 240 pods: 3
2025-04-24 16:27:26,470 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 3709.571ms, rate sampling interval: 14344ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.32s    12.06s   50.10s    58.57%
    Req/Sec    39.67      2.62    42.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.82s 
 75.000%   37.95s 
 90.000%   46.01s 
 99.000%   49.41s 
 99.900%   49.97s 
 99.990%   50.14s 
 99.999%   50.14s 
100.000%   50.14s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7970.815     0.000000            1         1.00
   11870.207     0.100000          202         1.11
   16080.895     0.200000          403         1.25
   20152.319     0.300000          604         1.43
   23871.487     0.400000          806         1.67
   27820.031     0.500000         1009         2.00
   29720.575     0.550000         1109         2.22
   31801.343     0.600000         1209         2.50
   33914.879     0.650000         1312         2.86
   35815.423     0.700000         1410         3.33
   37945.343     0.750000         1513         4.00
   39256.063     0.775000         1561         4.44
   41222.143     0.800000         1611         5.00
   42827.775     0.825000         1661         5.71
   43876.351     0.850000         1712         6.67
   45023.231     0.875000         1763         8.00
   45449.215     0.887500         1790         8.89
   46006.271     0.900000         1815        10.00
   46202.879     0.912500         1840        11.43
   46530.559     0.925000         1863        13.33
   47185.919     0.937500         1889        16.00
   47316.991     0.943750         1901        17.78
   47579.135     0.950000         1915        20.00
   47808.511     0.956250         1925        22.86
   48070.655     0.962500         1938        26.67
   48398.335     0.968750         1953        32.00
   48463.871     0.971875         1957        35.56
   48594.943     0.975000         1963        40.00
   48922.623     0.978125         1970        45.71
   49053.695     0.981250         1976        53.33
   49283.071     0.984375         1983        64.00
   49315.839     0.985938         1985        71.11
   49381.375     0.987500         1991        80.00
   49381.375     0.989062         1991        91.43
   49414.143     0.990625         1996       106.67
   49446.911     0.992188         1998       128.00
   49479.679     0.992969         1999       142.22
   49610.751     0.993750         2003       160.00
   49610.751     0.994531         2003       182.86
   49643.519     0.995313         2004       213.33
   49774.591     0.996094         2007       256.00
   49774.591     0.996484         2007       284.44
   49774.591     0.996875         2007       320.00
   49872.895     0.997266         2008       365.71
   49938.431     0.997656         2010       426.67
   49938.431     0.998047         2010       512.00
   49938.431     0.998242         2010       568.89
   49938.431     0.998437         2010       640.00
   49971.199     0.998633         2011       731.43
   49971.199     0.998828         2011       853.33
   50135.039     0.999023         2013      1024.00
   50135.039     1.000000         2013          inf
#[Mean    =    28315.274, StdDeviation   =    12056.908]
#[Max     =    50102.272, Total count    =         2013]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2459 requests in 1.00m, 30.27MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:     40.97
Transfer/sec:    516.47KB

2025-04-24 16:27:26,755 - Test completed: wrk2 -t1 -c8 -d60s -R240 --latency http://128.105.146.155/